In [3]:
import pandas as pd
import numpy as np
import ETL.config as config
import ETL.utils as utils
import ETL.extract_data as extract
import ETL.config as config
import importlib
importlib.reload(config)
importlib.reload(extract)

In [4]:
users = pd.read_csv(config.USERS_FILE_LOCAL)
users.sample(5)

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
713,1244,43,69,1976,5,Female,580 Fifth Boulevard,35.28,-81.28,$16073,$32775,$72785,637,1
198,1803,26,60,1993,4,Female,596 Mountain View Lane,41.66,-70.34,$23129,$47160,$64193,578,1
1533,173,63,62,1956,5,Female,440 North Street,32.45,-99.73,$16665,$30399,$19404,668,4
572,1817,52,64,1968,2,Female,25622 Lake Street,29.55,-95.27,$36253,$73920,$166395,683,1
1247,1676,51,65,1968,12,Male,919 Martin Luther King Lane,38.81,-94.45,$24981,$50936,$88447,681,3

In [5]:
#check data
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2000 non-null   int64
 1   current_age        2000 non-null   int64
 2   retirement_age     2000 non-null   int64
 3   birth_year         2000 non-null   int64
 4   birth_month        2000 non-null   int64
 5   gender             2000 non-null   object
 6   address            2000 non-null   object
 7   latitude           2000 non-null   float64
 8   longitude          2000 non-null   float64
 9   per_capita_income  2000 non-null   object
 10  yearly_income      2000 non-null   object
 11  total_debt         2000 non-null   object
 12  credit_score       2000 non-null   int64
 13  num_credit_cards   2000 non-null   int64
dtypes: float64(2), int64(7), object(5)
memory usage: 218.9+ KB

In [ ]:
#check duplicate values in id column
print(f'Total duplicate values in "id" colum: {users.duplicated(subset=['id']).sum()}')

Total duplicate values in "id" colum: 0

In [29]:
users.describe(include='all')

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
count,2000.000000,2000.000000,2000.000000,2000.000000,2000.000000,2000,2000,2000.000000,2000.000000,2000,2000,2000,2000.000000,2000.000000
unique,NaN,NaN,NaN,NaN,NaN,2,1999,NaN,NaN,1754,1948,1880,NaN,NaN
top,NaN,NaN,NaN,NaN,NaN,Female,506 Washington Lane,NaN,NaN,$0,$44128,$0,NaN,NaN
freq,NaN,NaN,NaN,NaN,NaN,1016,2,NaN,NaN,15,3,102,NaN,NaN
mean,999.500000,45.391500,66.237500,1973.803000,6.439000,NaN,NaN,37.389225,-91.554765,NaN,NaN,NaN,709.734500,3.073000
std,577.494589,18.414092,3.628867,18.421234,3.565338,NaN,NaN,5.114324,16.283293,NaN,NaN,NaN,67.221949,1.637379
min,0.000000,18.000000,50.000000,1918.000000,1.000000,NaN,NaN,20.880000,-159.410000,NaN,NaN,NaN,480.000000,1.000000
25%,499.750000,30.000000,65.000000,1961.000000,3.000000,NaN,NaN,33.837500,-97.395000,NaN,NaN,NaN,681.000000,2.000000
50%,999.500000,44.000000,66.000000,1975.000000,7.000000,NaN,NaN,38.250000,-86.440000,NaN,NaN,NaN,711.500000,3.000000
75%,1499.250000,58.000000,68.000000,1989.000000,10.000000,NaN,NaN,41.200000,-80.130000,NaN,NaN,NaN,753.000000,4.000000
max,1999.000000,101.000000,79.000000,2002.000000,12.000000,NaN,NaN,61.200000,-68.670000,NaN,NaN,NaN,850.000000,9.000000

In [30]:
users.sample(5)

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
1609,670,21,71,1998,3,Female,7469 El Camino Street,42.31,-83.21,$11773,$24006,$57226,801,2
571,1290,53,68,1966,6,Male,6223 Lexington Drive,33.10,-96.66,$32580,$66428,$197102,669,2
1841,517,33,71,1986,11,Male,87 Ocean Avenue,42.31,-83.21,$11773,$24009,$19085,811,4
916,50,68,72,1951,7,Female,267 Birch Boulevard,45.82,-88.06,$19243,$39238,$85457,702,4
818,541,51,70,1968,7,Female,2699 Littlewood Avenue,35.63,-95.95,$14293,$29144,$35268,645,1

In [ ]:
#etl_users.py
import pandas as pd
import logging
import ETL.config as config
logger = logging.getLogger(__name__)


def users_transform(df: pd.DataFrame) -> pd.DataFrame:
    """
    Transform the users DataFrame.
    
    Args:
        df (pd.DataFrame): The DataFrame to transform.
        
    Returns:
        pd.DataFrame: The transformed DataFrame.
    """
    try:
        logger.info('Starting transformation of users DataFrame')
        #clean up values from columns
        df['per_capita_income'] = df['per_capita_income'].fillna(0).str.extract(r'(\d+)').astype(int)
        df['yearly_income'] = df['yearly_income'].fillna(0).str.extract(r'(\d+)').astype(int)
        df['total_debt'] = df['total_debt'].fillna(0).str.extract(r'(\d+)').astype(int) 

        

        logger.info('✅Transformation of users DataFrame completed successfully')
        
    except Exception as e:
        logger.error(f'❌Error during transformation of users DataFrame: {e}')
        raise 
    return df

In [36]:
users_trasformed = users_transform(users)
users_trasformed.sample(5)

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
1164,1695,45,66,1974,12,Female,238 Ocean View Lane,33.94,-117.99,27973,57027,21798,709,4
1708,39,54,67,1965,5,Female,984 Eighth Avenue,41.29,-72.36,30281,61740,126015,583,2
719,1446,28,61,1991,4,Male,54 Burns Avenue,34.02,-94.73,13811,28163,50872,689,4
324,817,26,67,1993,5,Male,91 Lake Street,30.06,-89.93,32314,65888,162364,803,2
1509,903,25,67,1994,8,Male,2484 Essex Avenue,41.38,-72.85,29231,59599,79126,717,5

In [ ]:
import pandas as pd
import logging
import ETL.config as config

logger = logging.getLogger(__name__)

def extract_csv_data(file_path: str, data_type: str) -> pd.DataFrame:
    """
    Generic function to extract data from CSV files and return as DataFrame.
    Logs the number of records loaded or any errors encountered during the process.
    
    Args:
        file_path (str): Path to the CSV file to extract
        data_type (str): Name of the data type for logging purposes (e.g., 'cards', 'transactions', 'users')
    
    Returns:
        pd.DataFrame: DataFrame containing the extracted data
        
    Raises:
        Exception: Re-raises any exception encountered during CSV reading
    """
    try:
        df = pd.read_csv(file_path)
        logger.info(f"✅ Extracted {data_type}_data.csv with {len(df)} records")
        return df
    except Exception as e:
        logger.error(f"❌ Error extracting {data_type}_data.csv: {e}")
        raise

# Usage examples - replace your original functions with these calls:
def extract_cards_data() -> pd.DataFrame:
    return extract_csv_data(config.CARDS_FILE, 'cards')

def extract_transactions_data() -> pd.DataFrame:
    return extract_csv_data(config.TRANSACTIONS_FILE, 'transactions')

def extract_users_data() -> pd.DataFrame:
    return extract_csv_data(config.USERS_FILE, 'users')